加入库的概念
